<?php

use Illuminate\Database\Seeder;

class TasrifSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $tasrifExample = [
            // ['menambah/bertambah', 'زَادَ', 'يَزِيْدُ', 'زِيَادَة', null, 'زِدْ', '12.2'],
            // ['bertanya/meminta/memohon', 'سَأَلَ', 'يَسْأَلُ', 'سُؤَال', null, 'اِسْأَلْ', '12.1'],
            // ['selamat/sehat', 'سَلِمَ', 'يَسْلَمُ', 'سَلاَمَة', 'سَلِيْم', null, '12.1'],
            // ['masuk islam/tunduk/menyerah diri', 'أَسْلَمَ', 'يُسْلِمُ', 'إِسْلَام', 'مُسْلِم', 'أَسْلِمْ', '12.1'],

            ['mengetahui', 'عَلِمَ', 'يَعْلَمُ', 'عِلْم', 'عَالِم', 'اِعْلَمْ', '1.01 , 2.03' ],
            ['membaca', 'قَرَأَ', 'يَقْرَأ', 'قِرَاءَة', 'قَارِئ', 'اِقْرَأ', '1.02 , 2.02, 7.05' ],
            ['menulis', 'كَتَبَ', 'يَكْتُبُ', 'كِتَابَة', 'مَكْتُوْب', 'مَكْتَب', '1.03' ],
            ['menyayangi/mengasihi', 'رَحِمَ', 'يَرْحَمُ', 'رَحْمَة', null, 'اِرْحَمْ', '2.01, 7.07' ],
            ['menciptakan', 'خَلَقَ', 'يَخْلُقُ', 'خَلْق', 'خَالِق', null, '2.04' ],
            ['mengajarkan', 'عَلَّمَ', 'يُعَلِّمُ', 'تَعْلِيْم', 'مُعَلِّم', null, '2.05' ],
            ['berkata', 'قَالَ', 'يَقُوْل', 'قَوْل', 'قَائِل', 'قُلْ', '3.01,7.03' ],
            ['beribadah', 'عَبَدَ', 'يَعْبُدُ', 'عِبَادَة', 'عَابِد', 'اُعْبُدُ', '3.02, 7.02' ],
            ['menyaksikan', 'شَهِدَ', 'يَشْهَدُ', null, 'شَهَادَة', 'اِشْهَدْ', '4.01' ],
            ['mengutus', 'أَرْسَل', 'يَرْسِلُ', null, null, null, '4.02' ],
            ['memuji', 'حَمِدَ', 'يَحْمَدُ', 'حَمْد', null, 'اِحْمَدْ', '5.01,7.08' ],
            ['minta tolong', 'اِسْتَعَانَ', 'يَسْتَعِيْنُ', null, null, 'اِسْتَعِنْ', '5.02' ],
            ['memberi petunjuk', 'هَدَى', 'يَهْدِي', 'هَدًى،هِدَايَة', null, 'اِهْدِ', '5.03, 7.11' ],
            ['berdiri', 'قَامَ', 'يَقُوْمُ', 'قِيَام', null, 'قُمْ', '6.01,7.04' ],
            ['sujud', 'سَجَدَ', 'يَسْجُدُ', 'سُجُوْد،سَجْدَة', null, 'اُسْجُدْ', '6.02,7.01' ],
            ['duduk', 'جَلَسَ', 'يَجْلِسُ', 'جُلُوْس', null, 'اِجْلِسْ', '6.03, 7.09' ],
            ['mendengar', 'سَمِعَ', 'يَسْمَعُ', 'سَمْع', 'سَمِيْعٌ', 'اِسْمَعْ', '6.04' ],
            ['mengampuni', 'غَفَرَ', 'يَغْفِرُ', 'مَغْفِرَة', 'غَفُوْر،غَفَّار', 'اِغْفِرْ', '6.05, 7.10' ],
            ['minta ampun', 'اِسْتَغْفَرَ', 'يَسْتَغْفِرُ', 'اِسْتِغْفَار', null, 'اِسْتَغْفِرْ', '6.06, 7.13' ],
            ['memberi rezeki', 'رَزَقَ', 'يَرْزُقُ', 'رِزْقُ', 'رَزَّاق', 'اِرْزُقْ', '6.07' ],
            ['memaafkan', 'عَفَا', 'يَعْفُوْ', 'عَفْو', null, 'اُعْفُ', '6.08' ],
            ['ruku', 'رَكَعَ', 'يَرْكَعُ', null, null, 'اِرْكَعْ', '7.06' ],
            ['salat', 'صَلَّى', 'يُصَلِّى', null, null, 'صَلَّ', '7.12' ],
            ['memberi barakah', 'بَارَكَ', 'يُبَارَكُ', 'مُبَارَكَة', null, 'بَارِكْ', '8.01' ],
            ['menghidupkan', 'أَحْيَى', 'يُحْيِيْ', 'إِحْيَاء', null, null, '8.02' ],
            ['mematikan', 'أَمَاتَ', 'يُمِيْتُ', null, null, null, '8.03' ],
            ['mati', 'مَاتَ', 'يَمُوْتُ', 'مَوْتُ', 'مَيِّت', null, '8.04' ],
            ['menyekutukan', 'أَشْرَكَ', 'يُشْرِكُ', null, 'مُشْرِك', null, '8.05' ],
            ['menolong,membela', 'نَصَرَ', 'يَنْصُرُ', 'نَصْر', 'نَاصِر،نَصِيْر', 'اُنْصُرْ', '9.01' ],
            ['membuka', 'فَتَحَ', 'يَفْتَحُ', 'فَتْح', null, 'اِفْتَحْ', '9.02' ],
            ['melihat,berpendapat', 'رَأَى', 'يَرَى', 'رُؤْيَة،رَأَي', null, null, '9.03' ],
            ['masuk', 'دَخَلَ', 'يَدْخِلُ', 'دُخُوْل', null, 'اُدْخِلْ', '9.04' ],
            ['memasukan', 'أَدْخَلَ', 'يَدْخِلُ', null, null, null, '9.05' ],
            ['keluar', 'خَرَجَ', 'يَخْرُجُ', 'خُرُوْج', null, 'اُخْرُجْ', '9.06' ],
            ['mengeluarkan', 'أَخْرَجَ', 'يُخْرِجُ', null, null, null, '9.07' ],
            ['kembali (bertaubat)', 'تَابَ', 'يَتُوْبُ', 'تَوْبَة', 'تَوَّاب', 'تُبْ', '9.08' ],
            ['menerima taubat', null, 'يَتُوْبُعَلَى', null, 'تَوَّاب', null, '9.09' ],
            ['melindungi, menghindari', 'وَقَى', 'يَقِي', null, null, 'قِ', '10.01' ],
            ['bertaqwa', 'اِتَّقَى', 'يَتَّقِيْ', null, 'مُتَّقٍ', 'اِتَّقِ', '10.02' ],
            ['beriman', 'آمَنَ', 'يُؤْمِنُ', 'إِيْمَان', 'مُؤْمِن', 'آمِنْ', '10.03' ],
            ['berdiri', 'قَامَ', 'يَقُومُ', 'قِيَام', null, 'قُمْ', '10.04' ],
            ['mendirikan, melakukan', 'أَقَامَ', 'يُقِيْمُ', 'إِقَامَة', null, 'أَقِمْ', '10.05' ],
            ['berinfaq', 'أَنْفَقَ', 'يُنْفَقُ', 'اِنْفَاق', null, null, '10.06' ],
            ['turun', 'نَزَلَ', 'يَنْزِلُ', null, null, null, '10.07' ],
            ['menurunkan', 'أَنْزَلَ', 'يُنْزِلُ', null, null, null, '10.08' ]
            
        ];

        foreach ($tasrifExample as $tasrif) {
            DB::table('tasrifs')->insert([
                'arti' => $tasrif[0],
                'madi' => $tasrif[1],
                'mudhori' => $tasrif[2],
                'masdar' => $tasrif[3],
                'sifat' => $tasrif[4],
                'amr' => $tasrif[5],
                'bab' => $tasrif[6]
            ]);
        }

    }
}
